{
    "title": "Collaborative Research: Unravelling Stripped Supernovae - Synergy between Observations and Modeling",
    "author_id": "wolfgang_kerzendorf",
    "article_id": "news_nsf22_collab",
    "display":true,
    "article_date": "04-19-2023",
    "category": "News",
    "tags": [
        "news",
        "research",
        "grant"
    ],
    "short_description": "We are thrilled to announce that our NSF research proposal on studying massive stars and their explosive deaths, known as Stripped Supernovae, has been selected for funding.",
    "long_description": "We are delighted to announce that our NSF research proposal (led by Maryam Modjaz, Wolfgang Kerzendorf with large contributions by Marc Williamson) on the study of massive stars and their explosive deaths, known as Stripped Supernovae, has successfully secured funding. With access to the largest dataset of Stripped Supernovae in existence, our team aims to unravel the complexities surrounding these cataclysmic events. By analyzing the optical spectra and light curves of three dozen Stripped Supernovae, along with employing the open-source radiative transfer code TARDIS and machine learning technology, we will gain unprecedented insights into the progenitor make-up and explosion dynamics of these cosmic phenomena. This research has far-reaching implications, not only for understanding stellar evolution, but also for exploring the conditions required for jet production and clarifying the contentious SN-GRB progenitor models. By shedding light on these fundamental aspects, we will pave the way for utilizing Stripped Supernovae as indicators of star formation across vast cosmic distances and investigating their role in re-ionizing the Universe. Furthermore, our findings will help advance the field of time-domain astronomy, as our modeling framework can be adapted to analyze other types of supernovae and astrophysical events, such as Superluminous SNe Ic and kilonova spectra. This project will enable us to address critical questions, resolve long-standing controversies, and contribute to a deeper understanding of the cosmos.",
    "cover_image": "website_files/images/article_content/nsf22_collab_stripped.jpg",
    "content": {
    },
    "people_involved_ids": [
        "wolfgang_kerzendorf",
        "mwilliamson",
        "Maryam Modjaz http://www.maryammodjaz.com/"
    ],
    "links": []
}